import pandas as pd
import pytest


@pytest.fixture
def df():
    result = pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "27.12.2021 15:56:23",
                "11.11.2021 15:25:03",
                "31.10.2021 16:45:13",
            ],
            "Статус": ["OK", "OK", "OK", "OK"],
            "Сумма операции": [-372.00, -569.94, -224.00, 5900.00],
        }
    )
    return result


@pytest.fixture
def df_cards():
    return pd.DataFrame(
        {"Номер карты": ["*7197", "*7197", "*4556", "*4556"], "Сумма операции": [-8798.00, -56.00, -138.00, -89.43]}
    )


@pytest.fixture
def df_top_5():
    return pd.DataFrame(
        {
            "Сумма операции с округлением": [4000.00, 110.00, 8798.00, 2.96],
            "Дата платежа": ["28.09.2021", "24.09.2021", "21.09.2021", "30.12.2021 17:50:17"],
            "Сумма операции": [4000.00, -110.00, -8798.00, 2.96],
            "Категория": ["Переводы", "Аптеки", "ЖКХ", "Бонусы"],
            "Описание": ["Дмитрий Р.", "Аптека Вита", "ЖКУ Квартира", "Проценты на остаток"],
        }
    )
